Autodesk.Revit.UI.ViewSheetSetUIData.Create(System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Create a new view sheet set in auto sort mode
name:
View sheet set name to be created.
sheetSchemaId:
Sheet schema id to be sorted with.
viewSchemaId:
View schema id to be sorted with.
viewIds:
View id(s) to be saved with.
Returns:
ElementId is invalid if creates failed
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Create(System.String,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Create a new view sheet set in manual sort mode
name:
View sheet set name to be created.
viewIds:
View id(s) with order to be created with.
Returns:
ElementId is invalid if creates failed
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Save(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Save the changes for the current view sheet set in auto sort mode
elementId:
The view sheet set to be saved.
sheetSchemaId:
Sheet schema id to be sorted with.
viewSchemaId:
View schema id to be sorted with.
viewIds:
View id(s) to be saved with.
Returns:
False if Save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Save(Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Save the changes for the current view sheet set in manual sort mode
elementId:
The view sheet set to be saved.
viewIds:
View id(s) with order to be saved with.
Returns:
False if Save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.SetInSessionViewIds(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Sets the set of in-session's views' id.
elementIds:
The in-session view id set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null